app/controllers/comentarios_controller.rb

SELECT * FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
---
  def edit
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`, `created_at`) VALUES('2010-05-12 23:33:32', 'hahahahah teste de comentario', 'Restaurante', 3, '2010-05-12 23:33:32')
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 5)
UPDATE `comentarios` SET `comentavel_type` = 'Restaurante', `comentavel_id` = 3, `updated_at` = '2010-05-13 01:30:47' WHERE `id` = 5
---
  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
DELETE FROM `comentarios` WHERE `id` = 1
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy