app/controllers/qualificacoes_controller.rb

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 3)
---
  def new
    @qualificacao = Qualificacao.new
		if params[:cliente]
			@qualificacao.cliente = Cliente.find(params[:cliente])
		end
		if params[:restaurante]
			@qualificacao.restaurante = Restaurante.find(params[:restaurante])