app/controllers/restaurantes_controller.rb

	def index
	  @restaurantes = Restaurante.paginate :page=> params['page'], :per_page => 3
---
SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`

	def create
		@restaurante = Restaurante.new(params[:r])

		if @restaurante.save
---
INSERT INTO `restaurantes` (`data_abertura`, `updated_at`, `especialidade`, `endereco`, `nome`, `created_at`) VALUES(NULL, '2010-05-11 01:06:39', 'asdfasdf', 'sdf', 'A', '2010-05-11 01:06:39')

	def edit
		@restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 8)

	def update
		@restaurante = Restaurante.find(params[:id])
		if @restaurante.update_attributes(params[:restaurante])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 7)
UPDATE `restaurantes` SET `endereco` = 'Italiano', `especialidade` = 'Italiano', `updated_at` = '2010-05-11 23:09:49' WHERE `id` = 15

	def destroy
		@restaurante = Restaurante.find(params[:id])
		@restaurante.destroy
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 8)
DELETE FROM `restaurantes` WHERE `id` = 8

	def show
		@restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 4)

	def busca
		@restaurantes = []
		@restaurantes << Restaurante.find_by_especialidade(params[:especialidade])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`especialidade` = 'italiano') LIMIT 1